html/20231126T003030--why-i-am-using-emacs__emacs.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>why I am using emacs</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">15 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231126T003030--why-i-am-using-emacs__emacs.html">why I am using emacs</a></h1>
<ul class="org-ul">
<li>Most flexible and configurable editor in the multiverse.</li>
<li>It's free, was and <a href="https://www.gnu.org/philosophy/free-sw.html">forever will be</a>.</li>
<li>Complete built-in documentation</li>
<li>Packaging system, the community that creates them is great</li>
<li>Keyboard shortcuts similar to Linux shell's. Can't write anything without
those shortcuts now.</li>
<li>A wide range of functionality beyond text/code editing, including a
<a href="https://www.gnu.org/software/emacs/manual/org.html">project planner</a>, <a href="https://www.gnu.org/software/emacs/manual/gnus.html">mail
and news reader</a>, <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Debuggers.html">debugger interface</a>, <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Calendar_002fDiary.html">calendar</a>, <a href="https://www.gnu.org/savannah-checkouts/gnu/emacs/erc.html">IRC client</a>, and <a href="https://www.gnu.org/savannah-checkouts/gnu/emacs/further-information.html">more</a>.</li>
<li>According to Zygimantas, most developers WILL be running linux at work, so
don't fall for Windows OS.</li>
<li>Can create FOREVER notes, simple org files, text, so notes will forever be
readable(unlike other formats, storing them on cloud, etc.).</li>
<li>Torstein - The drive you have to always improve your tools and workflow will
take you and your career great places</li>
<li>I guess in some older companies where security (of all kinds) is an actual
issue, they mandate that everyone works through a VM, hosted remotely. And
when whatever you’re using to visually connect to the VM lags, and the VM
itself is pretty slow, and you have 10 people near you connecting to the same
router, it becomes a ridiculous pain to use an IDE.</li>
<li><a href="https://www.reddit.com/r/emacs/comments/z9u6c1/my_experience_with_emacs_and_the_eventual/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button">emacs till the day I die due to magit</a></li>
<li>think about using emacs + angular, bent jau prisirasyk cia kaip option</li>
<li>With Emacs and being able to change/modify/tweak things to be like I want,
create the functionality that I want, this exact mentality is the main reason
why I became a programmer.</li>
<li><a href="https://www.slideshare.net/yukihiro_matz/how-emacs-changed-my-life">How emacs changed my life</a></li>
</ul>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-emacs.html">emacs</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
